---
type: DocumentReloadLatestProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# DocumentReloadLatestProgressChangedEventArgs

`Autodesk.Revit.DB.Events.DocumentReloadLatestProgressChangedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsMerging | 2017 Subscription Update | `public bool IsMerging { get ; }` |
| Property | ReloadLatestFinished | 2017 Subscription Update | `public bool ReloadLatestFinished { get ; }` |
| Property | RetryTimes | 2017 Subscription Update | `public int RetryTimes { get ; }` |